onre/2.11BSD/usr/src/usr.sbin/trpt/trpt.8
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)trpt.8c	6.2.1 (2.11BSD) 2024/9/28
.\"
.TH TRPT 8C "September 28, 2024"
.UC 5
.SH NAME
trpt \- transliterate protocol trace
.SH SYNOPSIS
.B trpt
[
.B \-a
] [
.B \-s
]  [
.B \-t
] [
.B \-f
] [
.B \-j
] [
.B \-p
hex-address ]
[ system [ core ] ]
.SH DESCRIPTION
.I Trpt
interrogates the buffer of TCP trace records created
when a socket is marked for \*(lqdebugging\*(rq (see
.IR setsockopt (2)),
and prints a readable description of these records.
When no options are supplied, 
.I trpt
prints all the trace records found in the system
grouped according to TCP connection protocol control
block (PCB).  The following options may be used to
alter this behavior.
.TP
.B \-a
in addition to the normal output,
print the values of the source and destination
addresses for each packet recorded.
.TP
.B \-s
in addition to the normal output,
print a detailed description of the packet
sequencing information.
.TP
.B \-t
in addition to the normal output,
print the values for all timers at each
point in the trace.
.TP
.B \-f
follow the trace as it occurs, waiting a short time for additional records
each time the end of the log is reached.
.TP
.B \-j
just give a list of the protocol control block
addresses for which there are trace records.
.TP
.B \-p
show only trace records associated with the protocol
control block, the address of which follows.
.PP
The recommended use of
.I trpt
is as follows.
Isolate the problem and enable debugging on the
socket(s) involved in the connection.
Find the address of the protocol control blocks
associated with the sockets using the 
.B \-A
option to 
.IR netstat (1).
Then run
.I trpt
with the
.B \-p
option, supplying the associated
protocol control block addresses.
The
.B \-f
option can be used to follow the trace log once the trace is located.
If there are
many sockets using the debugging option, the
.B \-j
option may be useful in checking to see if
any trace records are present for the socket in
question.
The
.PP
If debugging is being performed on a system or
core file other than the default, the last two
arguments may be used to supplant the defaults.
.SH FILES
/unix
.br
/dev/kmem
.SH "SEE ALSO"
setsockopt(2), netstat(1), trsp(8C)
.SH DIAGNOSTICS
``no namelist'' when the system image doesn't
contain the proper symbols to find the trace buffer;
others which should be self explanatory.
.SH BUGS
Should also print the data for each input or output,
but this is not saved in the race record.
.PP
The output format is inscrutable and should be described
here.
